perf/resultado_bbox_1_load.txt

> perf@1.0.0 artillery /home/hugo/Desktop/Arq de Soft/Tp1/2c21-tp-1/perf
> artillery "run" "load-bbox.yaml" "-e" "black_box_1"

Started phase 0 (Load), duration: 600s @ 17:28:50(-0300) 2021-10-16
Report @ 17:29:00(-0300) 2021-10-16
Elapsed time: 10 seconds
  Scenarios launched:  49
  Scenarios completed: 45
  Requests completed:  45
  Mean response/sec: 5.01
  Response time (msec):
    min: 901
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 45

Report @ 17:29:10(-0300) 2021-10-16
Elapsed time: 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 901
    max: 907
    median: 901
    p95: 902
    p99: 907
  Codes:
    200: 50

Report @ 17:29:20(-0300) 2021-10-16
Elapsed time: 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:29:30(-0300) 2021-10-16
Elapsed time: 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:29:40(-0300) 2021-10-16
Elapsed time: 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 901
    max: 903
    median: 901
    p95: 902
    p99: 903
  Codes:
    200: 50

Report @ 17:29:50(-0300) 2021-10-16
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:30:00(-0300) 2021-10-16
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 901
    max: 905
    median: 901
    p95: 902
    p99: 905
  Codes:
    200: 50

Report @ 17:30:10(-0300) 2021-10-16
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 901
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:30:20(-0300) 2021-10-16
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:30:30(-0300) 2021-10-16
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:30:40(-0300) 2021-10-16
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:30:50(-0300) 2021-10-16
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:31:00(-0300) 2021-10-16
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:31:10(-0300) 2021-10-16
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:31:20(-0300) 2021-10-16
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:31:30(-0300) 2021-10-16
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:31:40(-0300) 2021-10-16
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:31:50(-0300) 2021-10-16
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:32:00(-0300) 2021-10-16
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:32:10(-0300) 2021-10-16
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:32:20(-0300) 2021-10-16
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:32:30(-0300) 2021-10-16
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:32:40(-0300) 2021-10-16
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 902
    p99: 904
  Codes:
    200: 50

Report @ 17:32:50(-0300) 2021-10-16
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:33:00(-0300) 2021-10-16
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:33:10(-0300) 2021-10-16
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:33:20(-0300) 2021-10-16
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:33:30(-0300) 2021-10-16
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:33:40(-0300) 2021-10-16
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:33:50(-0300) 2021-10-16
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:34:00(-0300) 2021-10-16
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:34:10(-0300) 2021-10-16
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:34:20(-0300) 2021-10-16
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:34:30(-0300) 2021-10-16
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:34:40(-0300) 2021-10-16
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:34:50(-0300) 2021-10-16
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:35:00(-0300) 2021-10-16
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:35:10(-0300) 2021-10-16
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 901
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:35:20(-0300) 2021-10-16
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:35:30(-0300) 2021-10-16
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:35:40(-0300) 2021-10-16
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:35:50(-0300) 2021-10-16
Elapsed time: 7 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 901
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:36:00(-0300) 2021-10-16
Elapsed time: 7 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 901
    max: 911
    median: 901
    p95: 902
    p99: 911
  Codes:
    200: 50

Report @ 17:36:10(-0300) 2021-10-16
Elapsed time: 7 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:36:20(-0300) 2021-10-16
Elapsed time: 7 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Report @ 17:36:30(-0300) 2021-10-16
Elapsed time: 7 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:36:40(-0300) 2021-10-16
Elapsed time: 7 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:36:50(-0300) 2021-10-16
Elapsed time: 8 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:37:00(-0300) 2021-10-16
Elapsed time: 8 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:37:10(-0300) 2021-10-16
Elapsed time: 8 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:37:20(-0300) 2021-10-16
Elapsed time: 8 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:37:30(-0300) 2021-10-16
Elapsed time: 8 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:37:40(-0300) 2021-10-16
Elapsed time: 8 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:37:50(-0300) 2021-10-16
Elapsed time: 9 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:38:00(-0300) 2021-10-16
Elapsed time: 9 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:38:10(-0300) 2021-10-16
Elapsed time: 9 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:38:20(-0300) 2021-10-16
Elapsed time: 9 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:38:30(-0300) 2021-10-16
Elapsed time: 9 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 50

Report @ 17:38:40(-0300) 2021-10-16
Elapsed time: 9 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 50

Report @ 17:38:50(-0300) 2021-10-16
Elapsed time: 10 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 50

Started phase 1 (End), duration: 10s @ 17:38:50(-0300) 2021-10-16
Report @ 17:39:00(-0300) 2021-10-16
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  1
  Scenarios completed: 5
  Requests completed:  5
  Mean response/sec: 0.1
  Response time (msec):
    min: 901
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 5

Report @ 17:39:00(-0300) 2021-10-16
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 17:39:00(-0300) 2021-10-16
  Scenarios launched:  3000
  Scenarios completed: 3000
  Requests completed:  3000
  Mean response/sec: 4.92
  Response time (msec):
    min: 900
    max: 911
    median: 901
    p95: 902
    p99: 902
  Scenario counts:
    Root (/): 3000 (100%)
  Codes:
    200: 3000